gatling/resources/data/Soap_request_0002.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.wizards.com/Service/2013-03" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:GetPersonByDciNumber>
         <!--Optional:-->
         <ns:request>
            <ns:AuthToken>${access_token}</ns:AuthToken>
            <ns:DciNumbers>
               <!--Zero or more repetitions:-->
               <arr:string>?</arr:string>
            </ns:DciNumbers>
         </ns:request>
      </ns:GetPersonByDciNumber>
   </soapenv:Body>
</soapenv:Envelope>